STMicroelectronics/STM32CubeL4/Drivers/BSP/STM32L4P5G-Discovery/stm32l4p5g_discovery_lcd.c
/**
  ******************************************************************************
  * @file    stm32l4p5g_discovery_lcd.c
  * @author  MCD Application Team
  * @brief   This file includes the driver for Liquid Crystal Display (LCD) module
  *          mounted on STM32L4P5G_DISCOVERY board.
  @verbatim
  1. How To use this driver:
  --------------------------
     - This driver is used to drive directly an LCD TFT using the LTDC controller.
     - This driver uses timing and setting for LPM012M503A LCD.

  2. Driver description:
  ---------------------
    + Initialization steps:
       o Initialize the LCD using the BSP_LCD_Init() function.
       o Apply the Layer configuration using the BSP_LCD_LayerDefaultInit() function.
       o Select the LCD layer to be used using the BSP_LCD_SelectLayer() function.
       o Enable the LCD display using the BSP_LCD_DisplayOn() function.

    + Options
       o Configure and enable the color keying functionality using the
         BSP_LCD_SetColorKeying() function.
       o Modify in the fly the transparency and/or the frame buffer address
         using the following functions:
         - BSP_LCD_SetTransparency()
         - BSP_LCD_SetLayerAddress()

    + Display on LCD
       o Clear the hole LCD using BSP_LCD_Clear() function or only one specified string
         line using the BSP_LCD_ClearStringLine() function.
       o Display a character on the specified line and column using the BSP_LCD_DisplayChar()
         function or a complete string line using the BSP_LCD_DisplayStringAtLine() function.
       o Display a string line on the specified position (x,y in pixel) and align mode
         using the BSP_LCD_DisplayStringAtLine() function.
       o Draw and fill a basic shapes (dot, line, rectangle, circle, ellipse, .. bitmap)
         on LCD using the available set of functions.
  @endverbatim
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32l4p5g_discovery_lcd.h"
#include "stm32l4p5g_discovery_io.h"
#include "../../../Utilities/Fonts/fonts.h"
#include "../../../Utilities/Fonts/font24.c"
#include "../../../Utilities/Fonts/font20.c"
#include "../../../Utilities/Fonts/font16.c"
#include "../../../Utilities/Fonts/font12.c"
#include "../../../Utilities/Fonts/font8.c"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32L4P5G_DISCOVERY
  * @{
  */

/** @defgroup STM32L4P5G_DISCOVERY_LCD STM32L4P5G_DISCOVERY LCD
  * @{
  */

/** @defgroup LPM012M503A_Exported_Constants
  * @{
  */

#define RTC_ASYNCH_PREDIV    0x7F /* LSE */
#define RTC_SYNCH_PREDIV     0xFF /* LSE */

/** @defgroup STM32L4P5G_DISCOVERY_RGB_LCD_Private_Defines Private Defines
  * @{
  */
#define POLY_X(Z)              ((int32_t)((Points + Z)->X))
#define POLY_Y(Z)              ((int32_t)((Points + Z)->Y))

/**
  * @}
  */

/** @defgroup STM32L4P5G_DISCOVERY_RGB_LCD_Private_Macros Private Macros
  * @{
  */
#define ABS(X)  ((X) > 0 ? (X) : -(X))
/**
  * @}
  */

/** @defgroup STM32L4P5G_DISCOVERY_RGB_LCD_Exported_Variables Exported Variables
  * @{
  */
/* DMA2D handle */
DMA2D_HandleTypeDef  hdma2d_disco;
/**
  * @}
  */

/** @defgroup STM32L4P5G_DISCOVERY_RGB_LCD_Private_Variables Private Variables
  * @{
  */


/* LTDC handle */
LTDC_HandleTypeDef  hltdc_disco;
RTC_HandleTypeDef RtcHandle_disco;

/* Default LCD configuration with LCD Layer 1 */
static uint32_t            ActiveLayer = LTDC_DEFAULT_ACTIVE_LAYER;
static LCD_DrawPropTypeDef DrawProp[LTDC_MAX_LAYER_NUMBER];
static uint8_t RTC_Config(void);
/**
  * @}
  */

/** @defgroup STM32L4P5G_DISCOVERY_RGB_LCD_Private_FunctionPrototypes Private Function Prototypes
  * @{
  */
static void DrawChar(uint16_t Xpos, uint16_t Ypos, const uint8_t *c);
static void FillTriangle(uint16_t x1, uint16_t x2, uint16_t x3, uint16_t y1, uint16_t y2, uint16_t y3);
static void LL_FillBuffer(uint32_t LayerIndex, void *pDst, uint32_t xSize, uint32_t ySize, uint32_t OffLine, uint32_t ColorIndex);
static void LL_ConvertLineToARGB8888(void * pSrc, void *pDst, uint32_t xSize, uint32_t ColorMode);
/**
  * @}
  */

/** @defgroup STM32L4P5G_DISCOVERY_RGB_LCD_Exported_Functions Exported Functions
  * @{
  */

/**
  * @brief  Initializes the LCD.
  * @retval LCD state
  */
uint8_t BSP_LCD_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIOs Configuration */
  /* Display */
  LCD_DISP_GPIO_CLK_ENABLE();
  GPIO_InitStruct.Pin = LCD_DISP_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
  HAL_GPIO_Init(LCD_DISP_GPIO_PORT, &GPIO_InitStruct);

  /* Data Enable */
  LCD_DE_GPIO_CLK_ENABLE();
  GPIO_InitStruct.Pin = LCD_DE_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
  HAL_GPIO_Init(LCD_DE_GPIO_PORT, &GPIO_InitStruct);

  /* Backlight */
  LCD_BL_CTRL_GPIO_CLK_ENABLE();
  GPIO_InitStruct.Pin = LCD_BL_CTRL_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
  HAL_GPIO_Init(LCD_BL_CTRL_GPIO_PORT, &GPIO_InitStruct);

  /* RTC configuration */
  if (RTC_Config() != LCD_OK)
  {
    return LCD_ERROR;
  }

  /* Enable Display */
  BSP_LCD_DisplayOn();

  /* LCD clock configuration */
  if (BSP_LCD_ClockConfig() != LCD_OK)
  {
    return LCD_ERROR;
  }



  /* LTDC setting */

  /* Timing Configuration */
  hltdc_disco.Init.HorizontalSync = 1;                // HSYNC width = 2 cycles
  hltdc_disco.Init.VerticalSync = 0;                  // VSYNC width = 1 cycle
  hltdc_disco.Init.AccumulatedHBP = 1+ 2;             // HBP = 2 cycles
  hltdc_disco.Init.AccumulatedVBP = 0+ 1;             // VBP = 1 cycle
  hltdc_disco.Init.AccumulatedActiveW = 1+2 + 240;    // HA  = 240  cycles
  hltdc_disco.Init.AccumulatedActiveH = 0+1 + 240;    // VA  = 240  cycles
  hltdc_disco.Init.TotalWidth = 1+2+240 + 2;          // HFP = 2 cycles
  hltdc_disco.Init.TotalHeigh = 0+1+240 + 2 +1;       // VFP = 2 cycles + 1 Extra cycle for synchronous stop
  /* Initialize the LCD pixel width and pixel height */
  hltdc_disco.LayerCfg->ImageWidth = 240;
  hltdc_disco.LayerCfg->ImageHeight = 240;
  /* Background value */
  hltdc_disco.Init.Backcolor.Blue = 0;
  hltdc_disco.Init.Backcolor.Green = 0x30; // 0XC0 : Blue /
  hltdc_disco.Init.Backcolor.Red = 0;
  /* Polarity */
  hltdc_disco.Init.HSPolarity = LTDC_HSPOLARITY_AL;
  hltdc_disco.Init.VSPolarity = LTDC_VSPOLARITY_AL;
  hltdc_disco.Init.DEPolarity = LTDC_DEPOLARITY_AL;
  hltdc_disco.Init.PCPolarity = LTDC_PCPOLARITY_IIPC;
  hltdc_disco.Instance = LTDC;


  if(HAL_LTDC_GetState(&hltdc_disco) == HAL_LTDC_STATE_RESET)
  {
    /* Initialize the LCD Msp: this __weak function can be rewritten by the application */
    BSP_LCD_MspInit(&hltdc_disco, NULL);
  }
  HAL_LTDC_Init(&hltdc_disco);



