STMicroelectronics/STM32CubeL4/Drivers/BSP/STM32L4P5G-Discovery/stm32l4p5g_discovery_lcd.c
    case 2:
      line =  (pchar[0]<< 8) | pchar[1];
      break;

    case 3:
    default:
      line =  (pchar[0]<< 16) | (pchar[1]<< 8) | pchar[2];
      break;
    }

    for (j = 0; j < width; j++)
    {
      if ((line & (1 << (width - j + offset - 1))) != 0)
      {
        BSP_LCD_DrawPixel((Xpos + j), Ypos, DrawProp[ActiveLayer].TextColor);
      }
      else
      {
        BSP_LCD_DrawPixel((Xpos + j), Ypos, DrawProp[ActiveLayer].BackColor);
      }
    }
    Ypos++;
  }
}

/**
  * @brief  Fills a triangle (between 3 points).
  * @param  x1: Point 1 X position
  * @param  y1: Point 1 Y position
  * @param  x2: Point 2 X position
  * @param  y2: Point 2 Y position
  * @param  x3: Point 3 X position
  * @param  y3: Point 3 Y position
  * @retval None
  */
static void FillTriangle(uint16_t x1, uint16_t x2, uint16_t x3, uint16_t y1, uint16_t y2, uint16_t y3)
{
  int16_t deltax = 0, deltay = 0, x = 0, y = 0, xinc1 = 0, xinc2 = 0,
  yinc1 = 0, yinc2 = 0, den = 0, num = 0, num_add = 0, num_pixels = 0,
  curpixel = 0;

  deltax = ABS(x2 - x1);        /* The difference between the x's */
  deltay = ABS(y2 - y1);        /* The difference between the y's */
  x = x1;                       /* Start x off at the first pixel */
  y = y1;                       /* Start y off at the first pixel */

  if (x2 >= x1)                 /* The x-values are increasing */
  {
    xinc1 = 1;
    xinc2 = 1;
  }
  else                          /* The x-values are decreasing */
  {
    xinc1 = -1;
    xinc2 = -1;
  }

  if (y2 >= y1)                 /* The y-values are increasing */
  {
    yinc1 = 1;
    yinc2 = 1;
  }
  else                          /* The y-values are decreasing */
  {
    yinc1 = -1;
    yinc2 = -1;
  }

  if (deltax >= deltay)         /* There is at least one x-value for every y-value */
  {
    xinc1 = 0;                  /* Don't change the x when numerator >= denominator */
    yinc2 = 0;                  /* Don't change the y for every iteration */
    den = deltax;
    num = deltax / 2;
    num_add = deltay;
    num_pixels = deltax;         /* There are more x-values than y-values */
  }
  else                          /* There is at least one y-value for every x-value */
  {
    xinc2 = 0;                  /* Don't change the x for every iteration */
    yinc1 = 0;                  /* Don't change the y when numerator >= denominator */
    den = deltay;
    num = deltay / 2;
    num_add = deltax;
    num_pixels = deltay;         /* There are more y-values than x-values */
  }

  for (curpixel = 0; curpixel <= num_pixels; curpixel++)
  {
    BSP_LCD_DrawLine(x, y, x3, y3);

    num += num_add;              /* Increase the numerator by the top of the fraction */
    if (num >= den)             /* Check if numerator >= denominator */
    {
      num -= den;               /* Calculate the new numerator value */
      x += xinc1;               /* Change the x as appropriate */
      y += yinc1;               /* Change the y as appropriate */
    }
    x += xinc2;                 /* Change the x as appropriate */
    y += yinc2;                 /* Change the y as appropriate */
  }
}

/**
  * @brief  Fills a buffer.
  * @param  LayerIndex: Layer index
  * @param  pDst: Pointer to destination buffer
  * @param  xSize: Buffer width
  * @param  ySize: Buffer height
  * @param  OffLine: Offset
  * @param  ColorIndex: Color index
  * @retval None
  */
static void LL_FillBuffer(uint32_t LayerIndex, void *pDst, uint32_t xSize, uint32_t ySize, uint32_t OffLine, uint32_t ColorIndex)
{
  /* Register to memory mode with ARGB8888 as color Mode */
  hdma2d_disco.Init.Mode         = DMA2D_R2M;
  if(hltdc_disco.LayerCfg[ActiveLayer].PixelFormat == LTDC_PIXEL_FORMAT_RGB565)
  { /* RGB565 format */
    hdma2d_disco.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
  }
  else
  { /* ARGB8888 format */
    hdma2d_disco.Init.ColorMode    = DMA2D_OUTPUT_RGB888;
  }
  hdma2d_disco.Init.OutputOffset = OffLine;

  hdma2d_disco.Instance = DMA2D;

  /* DMA2D Initialization */
  if(HAL_DMA2D_Init(&hdma2d_disco) == HAL_OK)
  {
    if(HAL_DMA2D_ConfigLayer(&hdma2d_disco, LayerIndex) == HAL_OK)
    {
      if (HAL_DMA2D_Start(&hdma2d_disco, ColorIndex, (uint32_t)pDst, xSize, ySize) == HAL_OK)
      {
        /* Polling For DMA transfer */
        HAL_DMA2D_PollForTransfer(&hdma2d_disco, 10);
      }
    }
  }
}

/**
  * @brief  Converts a line to an ARGB8888 pixel format.
  * @param  pSrc: Pointer to source buffer
  * @param  pDst: Output color
  * @param  xSize: Buffer width
  * @param  ColorMode: Input color mode
  * @retval None
  */
static void LL_ConvertLineToARGB8888(void *pSrc, void *pDst, uint32_t xSize, uint32_t ColorMode)
{
  /* Configure the DMA2D Mode, Color Mode and output offset */
  hdma2d_disco.Init.Mode         = DMA2D_M2M_PFC;
  hdma2d_disco.Init.ColorMode    = DMA2D_OUTPUT_ARGB8888;
  hdma2d_disco.Init.OutputOffset = 0;

  /* Foreground Configuration */
  hdma2d_disco.LayerCfg[1].AlphaMode = DMA2D_NO_MODIF_ALPHA;
  hdma2d_disco.LayerCfg[1].InputAlpha = 0xFF;
  hdma2d_disco.LayerCfg[1].InputColorMode = ColorMode;
  hdma2d_disco.LayerCfg[1].InputOffset = 0;

  hdma2d_disco.Instance = DMA2D;

  /* DMA2D Initialization */
  if(HAL_DMA2D_Init(&hdma2d_disco) == HAL_OK)
  {
    if(HAL_DMA2D_ConfigLayer(&hdma2d_disco, 1) == HAL_OK)
    {
      if (HAL_DMA2D_Start(&hdma2d_disco, (uint32_t)pSrc, (uint32_t)pDst, xSize, 1) == HAL_OK)
      {
        /* Polling For DMA transfer */
        HAL_DMA2D_PollForTransfer(&hdma2d_disco, 10);
      }
    }
  }
}

/**
  * @brief  Configure the RTC peripheral by selecting the clock source.
  * @param  None
  * @retval None
  */
uint8_t RTC_Config(void)
{
  /*##-1- Configure the RTC peripheral #######################################*/
  /* Configure RTC prescaler and RTC data registers */
  /* RTC configured as follows:
      - Hour Format    = Format 24
      - Asynch Prediv  = Value according to source clock
      - Synch Prediv   = Value according to source clock
      - OutPut         = Output Disable
      - OutPutRemap    = Enable to get CALIB on PB2
      - OutPutPolarity = High Polarity
      - OutPutType     = Open Drain */
  /* Enable the Calibration Output */

  RtcHandle_disco.Instance = RTC;
  RtcHandle_disco.Init.HourFormat = RTC_HOURFORMAT_24;
  RtcHandle_disco.Init.AsynchPrediv = RTC_ASYNCH_PREDIV; /* 0x7F */
  RtcHandle_disco.Init.SynchPrediv = RTC_SYNCH_PREDIV; /* (32768 kHz / 128) - 1 = 0xFF */
  RtcHandle_disco.Init.OutPut = RTC_OUTPUT_DISABLE; // As CALIB has to be output
  RtcHandle_disco.Init.OutPutRemap = RTC_OUTPUT_REMAP_POS1 ; // Remap set to PB2 (but need to use PC13 in final application)
  RtcHandle_disco.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
  RtcHandle_disco.Init.OutPutType = RTC_OUTPUT_TYPE_PUSHPULL;

  if(HAL_RTC_GetState(&RtcHandle_disco) == HAL_RTC_STATE_RESET)
  {
    /* Initialize the RTC Msp: this __weak function can be rewritten by the application */
    if (BSP_RTC_MspInit(&RtcHandle_disco, NULL) != LCD_OK)
    {
      return LCD_ERROR;
    }
  }
  if(HAL_RTC_Init(&RtcHandle_disco) != HAL_OK)
  {
    /* Initialization Error */
    return LCD_ERROR;
  }

  /* Ultra low power calibration  */
  if (HAL_RTCEx_SetLowPowerCalib(&RtcHandle_disco, RTC_LPCAL_SET) != HAL_OK)
  {
    /* Initialization Error */
    return LCD_ERROR;
  }

  /* Enable the calibration output */
  /* 1Hz = Backlight OFF */
  //HAL_RTCEx_SetCalibrationOutPut(&RtcHandle, RTC_CALIBOUTPUT_1HZ);
  HAL_RTCEx_SetCalibrationOutPut(&RtcHandle_disco, RTC_CALIBOUTPUT_512HZ);

  return LCD_OK;

}


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */



